{"number":2,"issue":"8046186","related":[],"depends":[],"created":"2011/06/23 20:00","name":" JEP Template","discussion":"discuss at openjdk dot java dot net","projectIds":[],"body":"//\n// JDK Enhancement Proposal (\"JEP\") body template, v2.0\n//\n// ==> Delete all lines starting with \"//\"\n//     before entering a proposal into JBS\n//\n// Instances of this template are meant to be evolving documents.  When\n// you initially draft a JEP you don't need to fill out every section of\n// the template, and in fact at that point you probably won't be able to\n// do so.  As you get feedback and build consensus around your proposal\n// you'll revise the JEP accordingly.  If your JEP is accepted and targeted\n// then you'll continue to revise it as the work progresses so that, once\n// it's complete, the JEP can serve as an authoritative record of what\n// was actually done.\n//\n// The body of a JEP uses the Markdown markup language\n// (http://daringfireball.net/projects/markdown/basics).\n//\n// All sections are optional except those marked REQUIRED.  Keep sections\n// in the order shown below.  If an optional section is not needed then\n// simply omit it rather than write something like \"None\".  Do not add\n// sections beyond those defined in the template.\n//\n// Use lines of dashes (\"----\") under section titles, not equals signs\n// (\"====\").  If you need subsections then use the \"###\" prefix before\n// subsection headings and \"####\" before sub-subsection headings.  Do not\n// use HTML markup (`<h2>`, etc.) for section headings.  In general, avoid\n// HTML markup unless it's absolutely necessary.\n\nSummary\n-------\n\n// REQUIRED -- Provide a short summary of the proposal, at most one or two\n// sentences.  This summary will be rolled up into feature lists, JSRs, and\n// other documents, so please take the time to make it short and sweet.\n\nGoals\n-----\n\n// What are the goals of this proposal?  Omit this section if you have\n// nothing to say beyond what's already in the summary.\n\nNon-Goals\n---------\n\n// Describe any goals you wish to identify specifically as being out of\n// scope for this proposal.\n\nSuccess Metrics\n---------------\n\n// If the success of this work can be gauged by specific numerical\n// metrics and associated goals then describe them here.\n\nMotivation\n----------\n\n// Why should this work be done?  What are its benefits?  Who's asking\n// for it?  How does it compare to the competition, if any?\n\nDescription\n-----------\n\n// REQUIRED -- Describe the enhancement in detail: Both what it is and,\n// to the extent understood, how you intend to implement it.  Summarize,\n// at a high level, all of the interfaces you expect to modify or extend,\n// including Java APIs, command-line switches, library/JVM interfaces,\n// and file formats.  Explain how failures in applications using this\n// enhancement will be diagnosed, both during development and in\n// production.  Describe any open design issues.\n//\n// This section will evolve over time as the work progresses, ultimately\n// becoming the authoritative high-level description of the end result.\n// Include hyperlinks to additional documents as required.\n\nAlternatives\n------------\n\n// Did you consider any alternative approaches or technologies?  If so\n// then please describe them here and explain why they were not chosen.\n\nTesting\n-------\n\n// What kinds of test development and execution will be required in order\n// to validate this enhancement, beyond the usual mandatory unit tests?\n// Be sure to list any special platform or hardware requirements.\n\nRisks and Assumptions\n---------------------\n\n// Describe any risks or assumptions that must be considered along with\n// this proposal.  Could any plausible events derail this work, or even\n// render it unnecessary?  If you have mitigation plans for the known\n// risks then please describe them.\n\nDependencies\n------------\n\n// Describe all dependencies that this JEP has on other JEPs, JBS issues,\n// components, products, or anything else.  Dependencies upon JEPs or JBS\n// issues should also be recorded as links in the JEP issue itself.\n//\n// Describe any JEPs that depend upon this JEP, and likewise make sure\n// they are linked to this issue in JBS.","updated":"2020/10/27 16:26","status":"Active"}