{"number":287,"issue":"8064399","related":[],"depends":[],"created":"2014/11/08 00:35","release":"9","name":" SHA-3 Hash Algorithms","discussion":"security dash dev at openjdk dot java dot net","projectIds":[],"body":"Summary Implement the SHA-3 cryptographic hash functions (BYTE-only) specified in NIST FIPS 202. Non-Goals This JEP will not implement the SHAKE128 and SHAKE256 extendable-output functions (XOFs) because they are not approved as hash functions. The latest PKCS11 v2.40 draft does not contain SHA-3 support. Thus, there is no change to the \"SunPKCS11\" provider. Also, this JEP will not implement SHA-3 based algorithms for other cryptographic functions such as Signatures, MACs, and Ciphers since there are no standards for them yet. Those will be covered in subsequent enhancements and/or JEPs. Motivation SHA-2 was published over 10 years ago, and although no significant attack on SHA-2 has been demonstrated, NIST perceived a need for a dissimilar cryptographic hash function as an alternative to SHA-2. Nine years in the making, SHA-3 is the first cryptographic hash algorithm NIST has developed using a public competition and vetting process. FIPS 202 \"SHA-3 Standard: Permutation-Based Hash and Extendable-Output Functions\" was finalized as a standard in August 2015. Cryptographic vendors such as BouncyCastle started supporting SHA-3 when FIPS 202 was still a draft. Solaris will also support SHA-3 in the coming Solaris 12.0 release. Since hash functions are used extensively in security applications and SHA-3 implementations are already being added by other vendors, it is important to provide support for SHA-3 in the JDK. Description FIPS 202 defines four new hash functions: SHA3-224, SHA3-256, SHA3-384, and SHA3-512. These can be implemented as new algorithms of the java.security.MessageDigest API under the standard names \"SHA3-224\", \"SHA3-256\", \"SHA3-384\", and \"SHA3-512\". No new APIs are necessary, since there are no parameters required. Here is the list of providers and the corresponding algorithm enhancements: \"SUN\" provider: SHA3-224, SHA3-256, SHA3-384, and SHA3-512 \"OracleUcrypto\" provider: SHA-3 digests supported by Solaris 12.0 Testing The implementation must pass the relevant known-answer tests provided by NIST where the input size is multiple of 8-bits and existing regression and unit tests.","updated":"2017/03/06 11:35","status":"Closed / Delivered"}