{"number":407,"issue":"8263550","related":[385],"depends":[],"created":"2021/03/13 05:41","release":"17","name":" Remove RMI Activation","discussion":"core dash libs dash dev at mail dot openjdk dot java dot net","projectIds":[],"body":"Summary Remove the Remote Method Invocation (RMI) Activation mechanism, while preserving the rest of RMI. Motivation The RMI Activation mechanism is obsolete and disused. It was deprecated for removal by JEP 385 in Java SE 15. No comments were received in response to that deprecation. Please see JEP 385 for the full background, rationale, risks, and alternatives. The Java EE Platform contained a technology called the JavaBeans Activation Framework (JAF). This was later renamed to Jakarta Activation as part of the Eclipse EE4J initiative. The JavaBeans Activation and Jakarta Activation technologies are completely unrelated to RMI Activation, and they are unaffected by the removal of RMI Activation from Java SE. Description Remove the java.rmi.activation package from the Java SE API specification Update the RMI Specification to remove mentions of RMI Activation Remove the JDK library code that implements the RMI Activation mechanism Remove the JDK regression tests for the RMI Activation mechanism Remove the JDK's rmid activation daemon and its documenation Risks and Assumptions No comments were received in response to the deprecation of RMI Activation by JEP 385. However, this does not constitute proof that there are no dependencies on RMI Activation. It is still possible that some existing system will be broken by the removal of RMI Activation. In turn, the existence of such a system is not necessarily a compelling reason to keep RMI Activation Instead, the removal of RMI Activation serves to emphasize the need for a better mitigation plan for that system. The plan does not need to be an emergency; an existing system that uses RMI Activation will continue to run for some time on older JDK versions that have long-term or extended support.","updated":"2021/07/07 22:30","status":"Closed / Delivered"}